#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.main.data.archive_file.lambda_function: Reading...
module.main.data.archive_file.lambda_function: Read complete after 1s [id=966380112fc320910fd80bf456aff3d9a512764d]
module.main.aws_s3_bucket.bucket: Refreshing state... [id=lapwing-item-news-dev-bucket]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.main.aws_s3_bucket.bucket has been deleted
  - resource "aws_s3_bucket" "bucket" {
      - arn                         = "arn:aws:s3:::lapwing-item-news-dev-bucket" -> null
      - id                          = "lapwing-item-news-dev-bucket" -> null
        tags                        = {}
        # (13 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.main.aws_iam_policy.lambda_policy will be created
  + resource "aws_iam_policy" "lambda_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "lapwing-item-news-dev-lambda-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "name"  = "lapwing-item-news"
          + "stage" = "dev"
        }
    }

  # module.main.aws_iam_policy.scheduler_policy will be created
  + resource "aws_iam_policy" "scheduler_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "lapwing-item-news-dev-scheduler-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "name"  = "lapwing-item-news"
          + "stage" = "dev"
        }
    }

  # module.main.aws_iam_role.lambda_role will be created
  + resource "aws_iam_role" "lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lapwing-item-news-dev-lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "name"  = "lapwing-item-news"
          + "stage" = "dev"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.main.aws_iam_role.scheduler_role will be created
  + resource "aws_iam_role" "scheduler_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "scheduler.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lapwing-item-news-dev-scheduler-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "name"  = "lapwing-item-news"
          + "stage" = "dev"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.main.aws_iam_role_policy_attachment.lambda will be created
  + resource "aws_iam_role_policy_attachment" "lambda" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "lapwing-item-news-dev-lambda-role"
    }

  # module.main.aws_iam_role_policy_attachment.scheduler will be created
  + resource "aws_iam_role_policy_attachment" "scheduler" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "lapwing-item-news-dev-scheduler-role"
    }

  # module.main.aws_lambda_function.lambda_function will be created
  + resource "aws_lambda_function" "lambda_function" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../../dist/out/index.zip"
      + function_name                  = "lapwing-item-news-dev-lambda"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-northeast-1"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs22.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "+8/Y2FWe5Ijc9tQBE/oWl8EcU8Kfm7ZUD7Adw4EJSvM="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "name"  = "lapwing-item-news"
          + "stage" = "dev"
        }
      + timeout                        = 20
      + version                        = (known after apply)

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.main.aws_s3_bucket.bucket will be created
  + resource "aws_s3_bucket" "bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "lapwing-item-news-dev-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-northeast-1"
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "name"  = "lapwing-item-news"
          + "stage" = "dev"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.main.aws_s3_bucket_policy.bucket_policy will be created
  + resource "aws_s3_bucket_policy" "bucket_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
      + region = "ap-northeast-1"
    }

  # module.main.aws_scheduler_schedule.invoke_lambda will be created
  + resource "aws_scheduler_schedule" "invoke_lambda" {
      + action_after_completion      = (known after apply)
      + arn                          = (known after apply)
      + group_name                   = "lapwing-item-news-dev-scheduler-group"
      + id                           = (known after apply)
      + name                         = "lapwing-item-news-dev-scheduler"
      + name_prefix                  = (known after apply)
      + region                       = "ap-northeast-1"
      + schedule_expression          = "cron(0/10 * * * ? *)"
      + schedule_expression_timezone = "Asia/Tokyo"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = (known after apply)
          + role_arn = (known after apply)

          + retry_policy {
              + maximum_event_age_in_seconds = 86400
              + maximum_retry_attempts       = 0
            }
        }
    }

  # module.main.aws_scheduler_schedule_group.group will be created
  + resource "aws_scheduler_schedule_group" "group" {
      + arn                    = (known after apply)
      + creation_date          = (known after apply)
      + id                     = (known after apply)
      + last_modification_date = (known after apply)
      + name                   = "lapwing-item-news-dev-scheduler-group"
      + name_prefix            = (known after apply)
      + region                 = "ap-northeast-1"
      + state                  = (known after apply)
      + tags_all               = {
          + "name"  = "lapwing-item-news"
          + "stage" = "dev"
        }
    }

  # module.main.aws_ssm_parameter.twitter_access_token will be created
  + resource "aws_ssm_parameter" "twitter_access_token" {
      + arn              = (known after apply)
      + data_type        = (known after apply)
      + has_value_wo     = (known after apply)
      + id               = (known after apply)
      + insecure_value   = (known after apply)
      + key_id           = (known after apply)
      + name             = "/lapwing-item-news/dev/Twitter/AccessToken"
      + region           = "ap-northeast-1"
      + tags_all         = {
          + "name"  = "lapwing-item-news"
          + "stage" = "dev"
        }
      + tier             = (known after apply)
      + type             = "SecureString"
      + value            = (sensitive value)
      + value_wo         = (write-only attribute)
      + value_wo_version = 1
      + version          = (known after apply)
    }

  # module.main.aws_ssm_parameter.twitter_access_token_secret will be created
  + resource "aws_ssm_parameter" "twitter_access_token_secret" {
      + arn              = (known after apply)
      + data_type        = (known after apply)
      + has_value_wo     = (known after apply)
      + id               = (known after apply)
      + insecure_value   = (known after apply)
      + key_id           = (known after apply)
      + name             = "/lapwing-item-news/dev/Twitter/AccessTokenSecret"
      + region           = "ap-northeast-1"
      + tags_all         = {
          + "name"  = "lapwing-item-news"
          + "stage" = "dev"
        }
      + tier             = (known after apply)
      + type             = "SecureString"
      + value            = (sensitive value)
      + value_wo         = (write-only attribute)
      + value_wo_version = 1
      + version          = (known after apply)
    }

  # module.main.aws_ssm_parameter.twitter_api_key will be created
  + resource "aws_ssm_parameter" "twitter_api_key" {
      + arn              = (known after apply)
      + data_type        = (known after apply)
      + has_value_wo     = (known after apply)
      + id               = (known after apply)
      + insecure_value   = (known after apply)
      + key_id           = (known after apply)
      + name             = "/lapwing-item-news/dev/Twitter/ApiKey"
      + region           = "ap-northeast-1"
      + tags_all         = {
          + "name"  = "lapwing-item-news"
          + "stage" = "dev"
        }
      + tier             = (known after apply)
      + type             = "SecureString"
      + value            = (sensitive value)
      + value_wo         = (write-only attribute)
      + value_wo_version = 1
      + version          = (known after apply)
    }

  # module.main.aws_ssm_parameter.twitter_api_secret will be created
  + resource "aws_ssm_parameter" "twitter_api_secret" {
      + arn              = (known after apply)
      + data_type        = (known after apply)
      + has_value_wo     = (known after apply)
      + id               = (known after apply)
      + insecure_value   = (known after apply)
      + key_id           = (known after apply)
      + name             = "/lapwing-item-news/dev/Twitter/ApiSecret"
      + region           = "ap-northeast-1"
      + tags_all         = {
          + "name"  = "lapwing-item-news"
          + "stage" = "dev"
        }
      + tier             = (known after apply)
      + type             = "SecureString"
      + value            = (sensitive value)
      + value_wo         = (write-only attribute)
      + value_wo_version = 1
      + version          = (known after apply)
    }

Plan: 15 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: `HiroM320`, Stage: `dev`*

If you want to deploy this, please comment `/deploy 18229978973 4177812508` on this PR.